Tekla.Structures.Drawing.TextAlignment
The alignment of the text.

Tekla.Structures.Drawing.TextAlignment.Left
The left aligned text.

Tekla.Structures.Drawing.TextAlignment.Center
The center aligned text.

Tekla.Structures.Drawing.TextAlignment.Right
The right aligned text.

Tekla.Structures.Drawing.TextAlignment.LeaderLine
The text is aligned to leader line direction